In [1]:
import pandas as pd

In [2]:
URL = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'
URL

'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'

In [3]:
df = pd.read_csv(URL)

## 데이터를 선택하는 기본 방법

In [6]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df.info()  # data frame의 요약 정보

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [8]:
df.describe()  # 숫자형 데이터에 대한 주요 통계 정보

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [14]:
print(df.loc[0])
print(df.loc[0, 'Pclass'])

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object
3

In [15]:
print(df.iloc[0])
print(df.iloc[0, 2])

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object
3

In [19]:
print(df.loc[:, 'PassengerId'])
print(df.iloc[:, 4])

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64
0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [30]:
print(df.loc[[x for x in range(5)], ['Survived', 'Ticket', 'Fare']])
print(df.loc[10:13, ['Age', 'SibSp']])  # df.loc에서 슬라이싱(a:b)은 a부터 b까지
print(df.iloc[10:13, [5, 6]])  # df.iloc에서 슬라이싱(a:b)은 a부터 b-1 까지

   Survived            Ticket     Fare
0         0         A/5 21171   7.2500
1         1          PC 17599  71.2833
2         1  STON/O2. 3101282   7.9250
3         1            113803  53.1000
4         0            373450   8.0500
     Age  SibSp
10   4.0      1
11  58.0      0
12  20.0      0
13  39.0      1
     Age  SibSp
10   4.0      1
11  58.0      0
12  20.0      0

## 조건부 필터링

In [60]:
titanic = pd.read_csv(URL)

In [61]:
# 예시 데이터프레임 생성
data = {
    '이름': ['철수', '영희', '민수', '지수'],
    '나이': [25, 30, 22, 35],
    '직업': ['학생', '회사원', '학생', '프리랜서']
}
df = pd.DataFrame(data)

# Data filtering: name_of_DataFrame(conditions)
# 나이가 25 이상인 행만 선택
filtered_df = df[df['나이'] >= 25]
print(filtered_df)

   이름  나이    직업
0  철수  25    학생
1  영희  30   회사원
3  지수  35  프리랜서

In [65]:
# 타이타닉 데이터프레임에서 Survived=1이고 나이가 25세 이상, 60세 이하인 데이터 필터링
# 필터링 후 'Age' 열만 보이게 조절
titanic[(titanic['Age'] >= 25) & (titanic['Age'] <= 60) & (titanic['Survived'] == 1)].loc[:,'Age']

1      38.0
2      26.0
3      35.0
8      27.0
11     58.0
       ...
871    47.0
874    28.0
879    56.0
880    25.0
889    26.0
Name: Age, Length: 167, dtype: float64

In [68]:
# 'Sex'에서 'male'인 행만 필터링
titanic[titanic['Sex'].isin(['male'])]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [69]:
# 'Sex'에서 not(~) 연산자를 써서 'male'이 아닌 행만 필터링
titanic[~titanic['Sex'].isin(['male'])]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

## 데이터 타입 변환

In [72]:
# 데이터 타입 확입
print(titanic.dtypes)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [74]:
# Age가 float64이므로 int64로 변경
# Age에 NaN이 있어서 fillna()를 통해 NaN을 변환 가능한 값으로 바꿔준 후 dtype 변경
# NaN을 변경 가능하도록 전환 후 astype()을 이용해 dtype 변환
titanic['Age'].fillna(titanic['Age'].mean(), inplace=True)
titanic['Age'] = titanic['Age'].astype(int)
print(titanic['Age'])

0      22
1      38
2      26
3      35
4      35
       ..
886    27
887    19
888    29
889    26
890    32
Name: Age, Length: 891, dtype: int32

## 데이터 정렬

In [81]:
# 예시 데이터프레임 생성
data = {
    '이름': ['철수', '영희', '민수', '지수'],
    '나이': [25, 30, 22, 35],
    '직업': ['학생', '회사원', '학생', '프리랜서']
}
df = pd.DataFrame(data)

# '나이' 기준으로 오름차순 정렬
# 정렬은 인덱스의 순서를 생각 안함
sorted_df = df.sort_values(by='나이')
print(sorted_df, "\n")

# '나이' 기준으로 내림차순 정렬
desc_sorted_df = df.sort_values(by='나이', ascending=False)
print(desc_sorted_df)

   이름  나이    직업
2  민수  22    학생
0  철수  25    학생
1  영희  30   회사원
3  지수  35  프리랜서

   이름  나이    직업
3  지수  35  프리랜서
1  영희  30   회사원
0  철수  25    학생
2  민수  22    학생

In [82]:
print(df.index)
print(sorted_df.index)  # 정렬로 인해 인덱스 순서가 어그러져서 RangeIndex에서 Index로 변환

RangeIndex(start=0, stop=4, step=1)
Index([2, 0, 1, 3], dtype='int64')

In [85]:
# '직업'을 기준으로, 같은 직업 내에서 '나이' 오름차순 정렬
sorted_df_multi = df.sort_values(by=['직업', '나이'])
print(sorted_df_multi)

   이름  나이    직업
3  지수  35  프리랜서
2  민수  22    학생
0  철수  25    학생
1  영희  30   회사원

In [86]:
# 인덱스 기준으로 정렬
sorted_index_df = df.sort_index()
print(sorted_index_df)

   이름  나이    직업
0  철수  25    학생
1  영희  30   회사원
2  민수  22    학생
3  지수  35  프리랜서

## 데이터 병합

In [95]:
# 예시 데이터프레임 생성
df1 = pd.DataFrame({
    '이름': ['철수', '영희', '민수'],
    '나이': [25, 30, 22]
})

df2 = pd.DataFrame({
    '이름': ['철수', '영희', '지수'],
    '직업': ['학생', '회사원', '프리랜서']
})

print(df1, "\n")
print(df2)

   이름  나이
0  철수  25
1  영희  30
2  민수  22

   이름    직업
0  철수    학생
1  영희   회사원
2  지수  프리랜서

In [96]:
# '이름'을 기준으로 병합
# merge는 SQL의 join과 같다
# how='inner'(기본값). how=outer, left, right으로 다양하게 병합 가능
merged_df = pd.merge(df1, df2, on='이름', how='inner')
print(merged_df)

   이름  나이   직업
0  철수  25   학생
1  영희  30  회사원

In [97]:
# 행 단위로 데이터프레임 연결
concat_df = pd.concat([df1, df2], axis=0)
print(concat_df, "\n")

# 열 단위로 데이터프레임 연결
concat_df_col = pd.concat([df1, df2], axis=1)
print(concat_df_col)

   이름    나이    직업
0  철수  25.0   NaN
1  영희  30.0   NaN
2  민수  22.0   NaN
0  철수   NaN    학생
1  영희   NaN   회사원
2  지수   NaN  프리랜서

   이름  나이  이름    직업
0  철수  25  철수    학생
1  영희  30  영희   회사원
2  민수  22  지수  프리랜서

In [98]:
# 예시 데이터프레임 생성
df3 = pd.DataFrame({
    '직업': ['학생', '회사원', '프리랜서'],
    '연봉': [2000, 3000, 4000]
}, index=['철수', '영희', '지수'])

df3

      직업    연봉
철수    학생  2000
영희   회사원  3000
지수  프리랜서  4000

In [99]:
# 인덱스를 기준으로 병합
joined_df = df1.set_index('이름').join(df3)
print(joined_df)

    나이   직업      연봉
이름
철수  25   학생  2000.0
영희  30  회사원  3000.0
민수  22  NaN     NaN

## 데이터 그룹화 및 집계

In [102]:
# 예시 데이터프레임 생성
data = {
    '이름': ['철수', '영희', '민수', '지수', '철수', '영희'],
    '과목': ['수학', '수학', '과학', '과학', '영어', '영어'],
    '점수': [90, 85, 95, 80, 75, 88]
}
df = pd.DataFrame(data)

# '이름'을 기준으로 그룹화
grouped = df.groupby('이름')
grouped

In [103]:
grouped['점수'].sum()

이름
민수     95
영희    173
지수     80
철수    165
Name: 점수, dtype: int64

In [105]:
grouped['점수'].agg(['sum', 'mean'])

    sum  mean
이름
민수   95  95.0
영희  173  86.5
지수   80  80.0
철수  165  82.5

In [106]:
grouped_multi = df.groupby(['이름', '과목'])['점수'].sum()
grouped_multi

이름  과목
민수  과학    95
영희  수학    85
    영어    88
지수  과학    80
철수  수학    90
    영어    75
Name: 점수, dtype: int64

## 피벗테이블

In [110]:
# 피벗테이블 생성: '이름'을 인덱스로, '과목'을 컬럼으로 하여 점수의 평균 계산
pivot = pd.pivot_table(df, index='이름', columns='과목', values='점수', aggfunc='mean')
pivot

과목    과학    수학    영어
이름
민수  95.0   NaN   NaN
영희   NaN  85.0  88.0
지수  80.0   NaN   NaN
철수   NaN  90.0  75.0

In [111]:
# 여러 집계 함수를 사용하는 경우
pivot = pd.pivot_table(df, index='이름', columns='과목', values='점수', aggfunc=['mean', 'sum'])
pivot

    mean               sum
과목    과학    수학    영어    과학    수학    영어
이름
민수  95.0   NaN   NaN  95.0   NaN   NaN
영희   NaN  85.0  88.0   NaN  85.0  88.0
지수  80.0   NaN   NaN  80.0   NaN   NaN
철수   NaN  90.0  75.0   NaN  90.0  75.0

In [112]:
# 집계 함수별로 각 행과 열의 합계를 추가
pivot = pd.pivot_table(df, index='이름', columns='과목', values='점수', aggfunc=['mean', 'sum'], margins=True)
pivot

     mean                      sum
과목     과학    수학    영어   All     과학     수학     영어  All
이름
민수   95.0   NaN   NaN  95.0   95.0    NaN    NaN   95
영희    NaN  85.0  88.0  86.5    NaN   85.0   88.0  173
지수   80.0   NaN   NaN  80.0   80.0    NaN    NaN   80
철수    NaN  90.0  75.0  82.5    NaN   90.0   75.0  165
All  87.5  87.5  81.5  85.5  175.0  175.0  163.0  513

In [116]:
# NaN은 0으로 대체
pivot = pd.pivot_table(df, index='이름', columns='과목', values='점수', aggfunc=['mean', 'sum'], margins=True, fill_value=0)
pivot

     mean                    sum
과목     과학    수학    영어   All   과학   수학   영어  All
이름
민수   95.0   0.0   0.0  95.0   95    0    0   95
영희    0.0  85.0  88.0  86.5    0   85   88  173
지수   80.0   0.0   0.0  80.0   80    0    0   80
철수    0.0  90.0  75.0  82.5    0   90   75  165
All  87.5  87.5  81.5  85.5  175  175  163  513

In [117]:
# 예시 데이터프레임 생성
data = {
    '이름': ['철수', '영희', '민수', '지수', '철수', '영희'],
    '과목': ['수학', '수학', '과학', '과학', '영어', '영어'],
    '점수': [90, 85, 95, 80, 75, 88],
    '나이': [15, 14, 13, 12, 13, 12]
}
df = pd.DataFrame(data)

In [118]:
agg_result = df.groupby('이름').agg({
    '점수': ['mean', 'sum', 'max'],
    '나이': ['max']
})

agg_result

      점수           나이
    mean  sum max max
이름
민수  95.0   95  95  13
영희  86.5  173  88  14
지수  80.0   80  80  12
철수  82.5  165  90  15

## 멀티 인덱스(Multi Index)

In [121]:
# 예시 데이터프레임 생성
data = {
    '도시': ['서울', '서울', '부산', '부산'],
    '년도': [2021, 2022, 2021, 2022],
    '인구수': [9700000, 9720000, 3400000, 3450000]
}
df = pd.DataFrame(data)

# '도시'와 '년도'를 멀티 인덱스로 설정
df_multi_index = df.set_index(['도시', '년도'])
df_multi_index

             인구수
도시 년도
서울 2021  9700000
   2022  9720000
부산 2021  3400000
   2022  3450000

In [122]:
# 멀티 인덱스를 튜플로 직접 생성
index = pd.MultiIndex.from_tuples([('서울', 2021), ('서울', 2022), ('부산', 2021), ('부산', 2022)], names=['도시', '년도'])
index

MultiIndex([('서울', 2021),
            ('서울', 2022),
            ('부산', 2021),
            ('부산', 2022)],
           names=['도시', '년도'])

In [123]:
# 데이터프레임에 적용
df_multi_index = pd.DataFrame({'인구수': [9700000, 9720000, 3400000, 3450000]}, index=index)
print(df_multi_index)

             인구수
도시 년도
서울 2021  9700000
   2022  9720000
부산 2021  3400000
   2022  3450000